adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
#include "msp430f5529.h"
#define ACTIVE
#ifdef ACTIVE

/* --COPYRIGHT--,BSD_EX
 * Copyright (c) 2021, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/

//******************************************************************************
//   BQ76952EVM demo code for MSP430FR2x55 + BQ769x2
//
//   Description: MSP430FR2x55 functions as the I2C host that communicates
//   with the BQ769x2 sending and receiving different types of commands.
//   ACLK = 32.768kHz REFO or external XT1, MCLK = SMCLK = 1MHz DCO
//
//                                     /|\ /|\
//                    MSP430FR2x55     10k  |
//                 -----------------    |  10k
//            /|\ |             P4.5|---+---|-- I2C Data (UCB1SDA)
//             |  |                 |       |
//             ---|RST          P4.4|-------+-- I2C Clock (UCB1SCL)
//                |                 |
//                |             P2.3|---> SHUT
//                |                 |
//                |             P4.2|---> UART RX
//                |                 |
//       LEDs <---|P8.0 -8.2       P4.3|<--- UART TX
//                |                 |
//
//
//   Andrew Han and Matt Sunna
//   Texas Instruments Inc.
//   August 2021
//   Built with Code Composer Studio (CCS) v10.1.1
//******************************************************************************

//------------------------------------------------------------------------------
// Includes
//------------------------------------------------------------------------------
#include <assert.h>
#include <msp430.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "BQ769x2Header.h"

//------------------------------------------------------------------------------
// Defines / macros
//------------------------------------------------------------------------------

// USER CONFIG HERE
#define NUM_CELLS 3
#define NUM_CELLS_BITS 0x0007 // bit 0 for cell 0, bit 3 for cell 3, etc. Write 1 to enable, write 0 to disable


// other 
#define DEV_ADDR 0x08 // BQ769x2 7-bit I2C address
#define CRC_Mode 0    // 0 = disabled, 1 = enabled

#define MAX_BUFFER_SIZE 10
#define R 0  // Read
#define W 1  // Write
#define W2 2 // Write data with two bytes

// Porting macros for F5529: match FR-style USCI flags
#define USCI_I2C_UCRXIFG0 USCI_I2C_UCRXIFG
#define USCI_I2C_UCTXIFG0 USCI_I2C_UCTXIFG

// These extra FIFO levels don't exist on F5529; they will never be hit
#define USCI_I2C_UCRXIFG1 0x12
#define USCI_I2C_UCRXIFG2 0x14
#define USCI_I2C_UCRXIFG3 0x16
#define USCI_I2C_UCTXIFG1 0x18
#define USCI_I2C_UCTXIFG2 0x1A
#define USCI_I2C_UCTXIFG3 0x1C

// Upper bound for __even_in_range
#define USCI_I2C_UCBIT9IFG USCI_I2C_UCTXIFG

//------------------------------------------------------------------------------
// Types
//------------------------------------------------------------------------------
typedef enum I2C_ModeEnum
{
    IDLE_MODE,
    NACK_MODE,
    TX_REG_ADDRESS_MODE,
    RX_REG_ADDRESS_MODE,
    TX_DATA_MODE,
    RX_DATA_MODE,
    SWITCH_TO_RX_MODE,
    SWITHC_TO_TX_MODE,
    TIMEOUT_MODE
} I2C_Mode;

typedef enum
{
    OUTPUT_HUMAN = 0,
    OUTPUT_JSON = 1
} OutputMode;

//------------------------------------------------------------------------------
// Globals
//------------------------------------------------------------------------------

// UART output mode

static OutputMode output_mode = OUTPUT_HUMAN; // default to human-readable output

// I2C state machine
I2C_Mode MasterMode = IDLE_MODE;
uint8_t TransmitRegAddr = 0;
uint8_t ReceiveBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t RXByteCtr = 0;
uint8_t ReceiveIndex = 0;
uint8_t TransmitBuffer[MAX_BUFFER_SIZE] = {0};
uint8_t TXByteCtr = 0;
uint8_t TransmitIndex = 0;

// RX / measurement buffers
uint8_t RX_data[2] = {0x00, 0x00};
uint8_t RX_32Byte[32] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

uint16_t CellVoltage[16] = {
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

float Temperature[3] = {0, 0, 0};
uint16_t Stack_Voltage = 0x00;
uint16_t Pack_Voltage = 0x00;
uint16_t LD_Voltage = 0x00;
uint16_t Pack_Current = 0x00;
uint16_t AlarmBits = 0x00;

uint8_t value_SafetyStatusA;
uint8_t value_SafetyStatusB;
uint8_t value_SafetyStatusC;
uint8_t value_PFStatusA;
uint8_t value_PFStatusB;
uint8_t value_PFStatusC;
uint8_t FET_Status;
uint16_t CB_ActiveCells;

uint8_t UV_Fault = 0;
uint8_t OV_Fault = 0;
uint8_t SCD_Fault = 0;
uint8_t OCD_Fault = 0;
uint8_t ProtectionsTriggered = 0;

