adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
uint8_t LD_ON = 0;
uint8_t DSG = 0;
uint8_t CHG = 0;
uint8_t PCHG = 0;
uint8_t PDSG = 0;

//------------------------------------------------------------------------------
// Function prototypes
//------------------------------------------------------------------------------

// Board / low-level
void GPIO_initPins(void);
void GPIO_configPins(void);
void LED_On(int32_t ledPin);
void LED_Off(int32_t ledPin);
void UART_Init(void);
void I2C_initModule(void);
void map_I2C_and_UART(void);

// Utility
void delayUS(uint16_t us);
int putchar(int c);
void CopyArray(uint8_t *source, uint8_t *dest, uint8_t count);
unsigned char Checksum(unsigned char *ptr, unsigned char len);

// I2C access
I2C_Mode I2C_ReadReg(uint8_t reg_addr, uint8_t *reg_data, uint8_t count);
I2C_Mode I2C_WriteReg(uint8_t reg_addr, uint8_t *reg_data, uint8_t count);

// BQ769x2 API
void BQ769x2_SetRegister(uint16_t reg_addr, uint32_t reg_data, uint8_t datalen);
void CommandSubcommands(uint16_t command);
void Subcommands(uint16_t command, uint16_t data, uint8_t type);
void DirectCommands(uint8_t command, uint16_t data, uint8_t type);
void BQ769x2_Init(void);

void BQ769x2_ReadFETStatus(void);
void BQ769x2_WriteFETStatus(bool DSG, bool CHG);
void update_fets_from_buttons(void);
void BQ769x2_ShutdownPin(void);
void BQ769x2_ReleaseShutdownPin(void);

uint16_t BQ769x2_ReadAlarmStatus(void);
void BQ769x2_ReadSafetyStatus(void);
void BQ769x2_ReadPFStatus(void);

uint16_t BQ769x2_ReadVoltage(uint8_t command);
void BQ769x2_ReadAllVoltages(void);
uint16_t BQ769x2_ReadCurrent(void);
float BQ769x2_ReadTemperature(uint8_t command);

// JSON/Hydrogen packets

void send_json_notification(const char *method,
                            const char *id,
                            const char *data_fmt, ...);

// --- 1. BMS output messages ---------------------------------------------------

void output_bms_config(const char *battery_type, int cell_count);
void output_bms_voltages(uint32_t v_mV, const uint16_t *CellVoltage, int cell_count);
void output_fet_status(bool chg, bool dsg);
void output_current_value(int16_t current_mA);

// --- output mode selection --------------------------------------------------

void set_output_mode(OutputMode mode)
{
    output_mode = mode; // set global output mode
}

//------------------------------------------------------------------------------
// main
//------------------------------------------------------------------------------
int main(void)
{
    // Stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;

    GPIO_initPins();
    map_I2C_and_UART();
    UART_Init();
    I2C_initModule();

    LED_On(0); // Popwer LED

    set_output_mode(OUTPUT_JSON);  // or OUTPUT_JSON

    CommandSubcommands(BQ769x2_RESET); // Reset the BQ769x2 registers
    delayUS(60000);

    BQ769x2_Init(); // Configure all BQ769x2 RAM settings
    delayUS(10000);

    BQ769x2_WriteFETStatus(0,1);
    CommandSubcommands(FET_ENABLE); // Enable CHG and DSG FETs
    delayUS(10000);

    CommandSubcommands(SLEEP_DISABLE); // Disable Sleep for full-speed measurements

    // Wait for FETs to close and measurements to settle
    delayUS(60000);
    delayUS(60000);
    delayUS(60000);
    delayUS(60000);

    delayUS(20000);
    delayUS(20000);
    delayUS(20000);

    LED_On(1);
    printf("hello world\n\r");
    output_bms_config("Li-ion", 3);


    while (1)
    {
        static int i = 0; // Loop counter for periodic output 

        // Read alarm status and check for new measurements
        AlarmBits = BQ769x2_ReadAlarmStatus();

        if (AlarmBits & 0x80)
        {
            // FULLSCAN complete: new measurements available
            BQ769x2_ReadAllVoltages();
            Pack_Current = BQ769x2_ReadCurrent();
            Temperature[0] = BQ769x2_ReadTemperature(TS1Temperature);
            Temperature[1] = BQ769x2_ReadTemperature(TS3Temperature);

            // Clear the FULLSCAN bit
            DirectCommands(AlarmStatus, 0x0080, W);
        }

        if (AlarmBits & 0xC000)
        {
            // Safety Status bits present in AlarmStatus
            BQ769x2_ReadSafetyStatus();

            if (ProtectionsTriggered & 1)
            {
                P1OUT |= BIT0; // Turn on LED to indicate protection
            }

            // Clear Safety Status Alarm bits
            DirectCommands(AlarmStatus, 0xF800, W);
        }
        else
        {
            if (ProtectionsTriggered & 1)
            {
                BQ769x2_ReadSafetyStatus();
                if (!(ProtectionsTriggered & 1))
                {
                    P1OUT &= ~BIT0; // Turn off LED when protection clears
                    printf("PROTECT");
                }
            }
        }

        // Output for every 20 cycles
        if (i % 20 == 0){
            printf("Running\n\r");
            output_bms_voltages(Stack_Voltage, CellVoltage, NUM_CELLS);
            update_fets_from_buttons();
            BQ769x2_ReadFETStatus();
            output_fet_status(CHG, DSG);
            output_current_value((int16_t)BQ769x2_ReadCurrent());
        }

        // Output for every 100 cycles
        if (i > 100){
            output_bms_config("Li-ion", 3);
            BQ769x2_ReadSafetyStatus();
            if (UV_Fault || OV_Fault || SCD_Fault || OCD_Fault){
                printf("Fault detected\n\r");
                printf("UV: %d", UV_Fault);
                printf("OV: %d", OV_Fault);
                printf("SCD: %d", SCD_Fault);
                printf("OCD: %d", OCD_Fault);
            }       
            i = 0;     
        }

        i++;
        delayUS(20000); // repeat loop every ~20 ms
    }
}

//------------------------------------------------------------------------------
// UART Output helper functions
//------------------------------------------------------------------------------

// Low level formatting function
static void send_json_notification_data(const char *method, const char *id, const char *data_str)
{
    uint32_t timestamp = 5005;

