adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
    printf("{\"method\":\"%s\","
           "\"data\":{%s},"
           "\"timestamp\":%lu,"
           "\"source\":\"robot\","
           "\"type\":\"notification\","
           "\"id\":\"%s\","
           "\"agent\":\"robot\"}\n",
           method, data_str, (unsigned long)timestamp, id);
}

// For simple, fixed data payloads
static void send_json_notification_fmt(const char *method,
                                       const char *id,
                                       const char *data_fmt, ...)
{
    char data_buf[256];
    va_list args;
    va_start(args, data_fmt);
    vsnprintf(data_buf, sizeof(data_buf), data_fmt, args); // format into data_buf
    va_end(args);

    send_json_notification_data(method, id, data_buf);
}

// -----------------------------------------------------------------------------
// Public “user” functions (no JSON/quote escaping here)
// -----------------------------------------------------------------------------

// 1. BMS/config  --------------------------------------------------------------

void output_bms_config(const char *battery_type, int cell_count)
{
    const char* type = "battery_type";
    const char* count = "cell_count";
    if (output_mode == OUTPUT_HUMAN)
    {
        printf("BMS config:\n\r");
        printf("  %s: %s\n\r", type, battery_type);
        printf("  %s: %d\n\r", count, cell_count);
    }
    else
    {
        // all escaping handled inside send_json_notification_fmt()
        send_json_notification_fmt(
            "/BMS/config",
            "001",
            "\"%s\":\"%s\",\"%s\":%d",
            type, battery_type, count, cell_count);
    }
}

// 2. Pack + cell voltages  ----------------------------------------------------
// v_mV: pack voltage in millivolts
// CellVoltage[i]: per-cell voltage in millivolts

void output_bms_voltages(uint32_t v_mV, const uint16_t *CellVoltage, int cell_count)
{
    if (output_mode == OUTPUT_HUMAN)
    {
        printf("Pack voltage: %u.%03u V\n\r",
               v_mV / 1000, v_mV % 1000);

        for (int i = 0; i < cell_count; i++)
        {
            printf("    Battery %d voltage: %u.%03u V\n\r",
                   i + 1,
                   CellVoltage[i] / 1000,
                   CellVoltage[i] % 1000);
        }
    }
    else
    {
        // build dynamic JSON data body, then wrap with send_json_notification_data()
        char data_buf[256];
        int len = 0;

        // pack voltage
        len += snprintf(data_buf + len, sizeof(data_buf) - len,
                        "\"pack_voltage_V\":%u.%03u",
                        v_mV / 1000, v_mV % 1000);

        // cell voltages
        for (int i = 0; i < cell_count && len < (int)sizeof(data_buf); i++)
        {
            len += snprintf(data_buf + len, sizeof(data_buf) - len,
                            ",\"cell%d_voltage_V\":%u.%03u",
                            i + 1,
                            CellVoltage[i] / 1000,
                            CellVoltage[i] % 1000);
        }

        send_json_notification_data("/BMS/voltages",
                                    "002",
                                    data_buf);
    }
}

// Example function here
void output_fet_status(bool chg, bool dsg)
{
    const char* chgStatus = "CHG_Status";
    const char* dsgStatus = "DSG_Status";
    if (output_mode == OUTPUT_HUMAN)
    {
        printf("%s: %d  %s: %d \n\r", chgStatus, chg, dsgStatus, dsg);
    }
    else
    {
        // all escaping handled inside send_json_notification_fmt()
        send_json_notification_fmt(
            "/BMS/fet_status",
            "003",
            "\"%s\":%d,\"%s\":%d",
            chgStatus, chg, dsgStatus, dsg);
    }
}

void output_error_notifications(bool UV, bool OV, bool SCD, bool OCD)
{
    const char* UV_s = "Under_Voltage_Status";
    const char* OV_s = "Over_Voltage_Status";
    const char* SCD_s = "SCD_Status";
    const char* OCD_s = "OCD_Status";
    if (output_mode == OUTPUT_HUMAN)
    {
        printf("%s: %d  %s: %d  %s: %d  %s: %d \n\r", UV_s, UV, OV_s, OV, SCD_s, SCD, OCD_s, OCD);
    }
    else
    {
        // all escaping handled inside send_json_notification_fmt()
        send_json_notification_fmt(
            "/BMS/error_notifications",
            "004",
            "\"%s\":%d,\"%s\":%d,\"%s\":%d,\"%s\":%d",
            UV_s, UV, OV_s, OV, SCD_s, SCD, OCD_s, OCD);
    }
}

void output_current_value(int16_t current_mA)
{
    const char* current_s = "Current_mA";
    if (output_mode == OUTPUT_HUMAN)
    {
        printf("%s: %d \n\r", current_s, current_mA);
    }
    else
    {
        // all escaping handled inside send_json_notification_fmt()
        send_json_notification_fmt(
            "/BMS/current_measurement",
            "005",
            "\"%s\":%d",
            current_s, current_mA);
    }
}



//------------------------------------------------------------------------------
// High-level BQ769x2 helpers
//------------------------------------------------------------------------------

void BQ769x2_Init(void)
{
    // Enter CONFIGUPDATE mode (Subcommand 0x0090)
    CommandSubcommands(SET_CFGUPDATE);

    // Power configuration
    BQ769x2_SetRegister(PowerConfig, 0x2D80, 2);

    // Enable REG0 pre-regulator
    BQ769x2_SetRegister(REG0Config, 0x01, 1);

    // Enable REG1 with 3.3 V output
    BQ769x2_SetRegister(REG12Config, 0x0D, 1);

    // DFETOFF pin controls both CHG and DSG FET
    BQ769x2_SetRegister(DFETOFFPinConfig, 0x42, 1);

    // ALERT pin configuration
    BQ769x2_SetRegister(ALERTPinConfig, 0x2A, 1);

    // TS1 measures cell temperature
    BQ769x2_SetRegister(TS1Config, 0x07, 1);

    // TS3 measures FET temperature
    BQ769x2_SetRegister(TS3Config, 0x0F, 1);

    // HDQ pin: no thermistor on EVM; set to 0
    BQ769x2_SetRegister(HDQPinConfig, 0x00, 1);

    // VCell Mode: enable 16 cells
    BQ769x2_SetRegister(VCellMode, NUM_CELLS_BITS, 2);

    // Enabled Protections A: SCD, OCD1, OCC, COV, CUV
    BQ769x2_SetRegister(EnabledProtectionsA, 0xBC, 1);

    // Enabled Protections B: all enabled
    BQ769x2_SetRegister(EnabledProtectionsB, 0xF7, 1);

    // Default Alarm Mask
    BQ769x2_SetRegister(DefaultAlarmMask, 0xF882, 2);

    // Cell balancing configuration
    BQ769x2_SetRegister(BalancingConfiguration, 0x03, 1);

