adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
    // CUV Threshold
    BQ769x2_SetRegister(CUVThreshold, 0x31, 1);

    // COV Threshold
    BQ769x2_SetRegister(COVThreshold, 0x55, 1);

    // OCC Threshold
    BQ769x2_SetRegister(OCCThreshold, 0x05, 1);

    // OCD1 Threshold
    BQ769x2_SetRegister(OCD1Threshold, 0x0A, 1);

    // SCD Threshold
    BQ769x2_SetRegister(SCDThreshold, 0x05, 1);

    // SCD Delay
    BQ769x2_SetRegister(SCDDelay, 0x03, 1);

    // SCDL latch limit
    BQ769x2_SetRegister(SCDLLatchLimit, 0x01, 1);

    // Exit CONFIGUPDATE mode
    CommandSubcommands(EXIT_CFGUPDATE);
}

uint16_t BQ769x2_ReadAlarmStatus(void)
{
    DirectCommands(AlarmStatus, 0x00, R);
    return (RX_data[1] * 256 + RX_data[0]);
}

void BQ769x2_ReadSafetyStatus(void)
{
    // Safety Status A
    DirectCommands(SafetyStatusA, 0x00, R);
    value_SafetyStatusA = (RX_data[1] * 256 + RX_data[0]);

    UV_Fault = ((0x4 & RX_data[0]) >> 2);
    OV_Fault = ((0x8 & RX_data[0]) >> 3);
    SCD_Fault = ((0x8 & RX_data[1]) >> 3);
    OCD_Fault = ((0x2 & RX_data[1]) >> 1);

    // Safety Status B
    DirectCommands(SafetyStatusB, 0x00, R);
    value_SafetyStatusB = (RX_data[1] * 256 + RX_data[0]);

    // Safety Status C
    DirectCommands(SafetyStatusC, 0x00, R);
    value_SafetyStatusC = (RX_data[1] * 256 + RX_data[0]);

    if ((value_SafetyStatusA + value_SafetyStatusB + value_SafetyStatusC) > 1)
    {
        ProtectionsTriggered = 1;
    }
    else
    {
        ProtectionsTriggered = 0;
    }
}

void BQ769x2_ReadPFStatus(void)
{
    DirectCommands(PFStatusA, 0x00, R);
    value_PFStatusA = (RX_data[1] * 256 + RX_data[0]);

    DirectCommands(PFStatusB, 0x00, R);
    value_PFStatusB = (RX_data[1] * 256 + RX_data[0]);

    DirectCommands(PFStatusC, 0x00, R);
    value_PFStatusC = (RX_data[1] * 256 + RX_data[0]);
}

void BQ769x2_ReadFETStatus(void)
{
    DirectCommands(FETStatus, 0x00, R);
    FET_Status = (RX_data[1] * 256 + RX_data[0]);

    DSG = ((0x4 & RX_data[0]) >> 2);
    CHG = (0x1 & RX_data[0]);
    PCHG = ((0x2 & RX_data[0]) >> 1);
    PDSG = ((0x8 & RX_data[0]) >> 3);
}

void BQ769x2_WriteFETStatus(bool DSG, bool CHG){
    uint8_t State = 0;

    // DSG control
    if (!DSG){
        State |= (1 << 0);  // set DSG_OFF bit = force off
    }

    // CHG control
    if (!CHG){
        State |= (1 << 2);  // set CHG_OFF bit = force off
    }

    Subcommands(FET_CONTROL, State, 1);   // or whatever your write call requires
}

void update_fets_from_buttons(void)
{
    bool dsg_enable = false;
    bool chg_enable = false;

    if (P3IN & BIT3) {
        dsg_enable = true;        // p3.3 high -> enable discharge
    }

    if (P3IN & BIT4) {
        chg_enable = true;        // p3.4 high -> enable charge
    }

    BQ769x2_WriteFETStatus(dsg_enable, chg_enable);   // apply fet control
}




void BQ769x2_ShutdownPin(void)
{
    P2OUT |= BIT3;
}

void BQ769x2_ReleaseShutdownPin(void)
{
    P2OUT &= ~BIT3;
}

uint16_t BQ769x2_ReadVoltage(uint8_t command)
{
    DirectCommands(command, 0x00, R);

    if (command >= Cell1Voltage && command <= Cell16Voltage)
    {
        // Cell 1–16: mV
        return (RX_data[1] * 256 + RX_data[0]);
    }
    else
    {
        // Stack / Pack / LD: 0.01 V units
        return 10 * (RX_data[1] * 256 + RX_data[0]);
    }
}

void BQ769x2_ReadAllVoltages(void)
{
    unsigned char x;
    int cellvoltageholder = Cell1Voltage;

    for (x = 0; x < 16; x++)
    {
        CellVoltage[x] = BQ769x2_ReadVoltage(cellvoltageholder);
        cellvoltageholder += 2;
    }

    Stack_Voltage = BQ769x2_ReadVoltage(StackVoltage);
    Pack_Voltage = BQ769x2_ReadVoltage(PACKPinVoltage);
    LD_Voltage = BQ769x2_ReadVoltage(LDPinVoltage);
}

uint16_t BQ769x2_ReadCurrent(void)
{
    DirectCommands(CC2Current, 0x00, R);
    return (RX_data[1] * 256 + RX_data[0]); // mA
}

float BQ769x2_ReadTemperature(uint8_t command)
{
    DirectCommands(command, 0x00, R);
    return (0.1f * (float)(RX_data[1] * 256 + RX_data[0])) - 273.15f;
}

//------------------------------------------------------------------------------
// Low-level BQ769x2 register / command helpers
//------------------------------------------------------------------------------

void BQ769x2_SetRegister(uint16_t reg_addr, uint32_t reg_data, uint8_t datalen)
{
    uint8_t TX_Buffer[2] = {0x00, 0x00};
    uint8_t TX_RegData[6] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

    //TX_RegData in little endian format
    TX_RegData[0] = reg_addr & 0xff;
    TX_RegData[1] = (reg_addr >> 8) & 0xff;
    TX_RegData[2] = reg_data & 0xff; //1st byte of data

    switch(datalen)
    {
        case 1: //1 byte datalength
            I2C_WriteReg(0x3E, TX_RegData, 3);
            delayUS(2000);
            TX_Buffer[0] = Checksum(TX_RegData, 3);
            TX_Buffer[1] = 0x05; //combined length of register address and data
            I2C_WriteReg(0x60, TX_Buffer, 2); // Write the checksum and length
            delayUS(2000);
            break;
        case 2: //2 byte datalength
            TX_RegData[3] = (reg_data >> 8) & 0xff;
            I2C_WriteReg(0x3E, TX_RegData, 4);
            delayUS(2000);
            TX_Buffer[0] = Checksum(TX_RegData, 4);
            TX_Buffer[1] = 0x06; //combined length of register address and data
            I2C_WriteReg(0x60, TX_Buffer, 2); // Write the checksum and length
            delayUS(2000);
            break;
        case 4: //4 byte datalength, Only used for CCGain and Capacity Gain
            TX_RegData[3] = (reg_data >> 8) & 0xff;
            TX_RegData[4] = (reg_data >> 16) & 0xff;
            TX_RegData[5] = (reg_data >> 24) & 0xff;
            I2C_WriteReg(0x3E, TX_RegData, 6);
            delayUS(2000);
            TX_Buffer[0] = Checksum(TX_RegData, 6);
            TX_Buffer[1] = 0x08; //combined length of register address and data
            I2C_WriteReg(0x60, TX_Buffer, 2); // Write the checksum and length
            delayUS(2000);
            break;
    }
}

void CommandSubcommands(uint16_t command) //For Command only Subcommands
// See the TRM or the BQ76952 header file for a full list of Command-only subcommands
{   //For DEEPSLEEP/SHUTDOWN subcommand you will need to call this function twice consecutively

    uint8_t TX_Reg[2] = {0x00, 0x00};

    //TX_Reg in little endian format
    TX_Reg[0] = command & 0xff;
    TX_Reg[1] = (command >> 8) & 0xff;

    I2C_WriteReg(0x3E,TX_Reg,2);
    delayUS(2000);
}

void Subcommands(uint16_t command, uint16_t data, uint8_t type)
// See the TRM or the BQ76952 header file for a full list of Subcommands
{
    //security keys and Manu_data writes dont work with this function (reading these commands works)
    //max readback size is 32 bytes i.e. DASTATUS, CUV/COV snapshot
    uint8_t TX_Reg[4] = {0x00, 0x00, 0x00, 0x00};
    uint8_t TX_Buffer[2] = {0x00, 0x00};

    //TX_Reg in little endian format
    TX_Reg[0] = command & 0xff;
    TX_Reg[1] = (command >> 8) & 0xff;

    if (type == R) {//read
        I2C_WriteReg(0x3E,TX_Reg,2);
        delayUS(2000);
        I2C_ReadReg(0x40, RX_32Byte, 32); //RX_32Byte is a global variable
    }
    else if (type == W) {
        //FET_Control, REG12_Control
        TX_Reg[2] = data & 0xff;
        I2C_WriteReg(0x3E,TX_Reg,3);
        delayUS(1000);
        TX_Buffer[0] = Checksum(TX_Reg, 3);
        TX_Buffer[1] = 0x05; //combined length of registers address and data
        I2C_WriteReg(0x60, TX_Buffer, 2);
        delayUS(1000);
    }
    else if (type == W2){ //write data with 2 bytes
        //CB_Active_Cells, CB_SET_LVL
        TX_Reg[2] = data & 0xff;
        TX_Reg[3] = (data >> 8) & 0xff;
        I2C_WriteReg(0x3E,TX_Reg,4);
        delayUS(1000);
        TX_Buffer[0] = Checksum(TX_Reg, 4);
        TX_Buffer[1] = 0x06; //combined length of registers address and data
        I2C_WriteReg(0x60, TX_Buffer, 2);
        delayUS(1000);
    }
}

void DirectCommands(uint8_t command, uint16_t data, uint8_t type)
// See the TRM or the BQ76952 header file for a full list of Direct Commands
{   //type: R = read, W = write
    uint8_t TX_data[2] = {0x00, 0x00};

    //little endian format
    TX_data[0] = data & 0xff;
    TX_data[1] = (data >> 8) & 0xff;

    if (type == R) {//Read
        I2C_ReadReg(command, RX_data, 2); //RX_data is a global variable
        delayUS(2000);
    }
    if (type == W) {//write
    //Control_status, alarm_status, alarm_enable all 2 bytes long
        I2C_WriteReg(command,TX_data,2);
        delayUS(2000);
    }
}

//------------------------------------------------------------------------------
// Utility functions
//------------------------------------------------------------------------------

void delayUS(uint16_t us)
{
    uint16_t ms = us / 1000;
    for (uint16_t i = 0; i < ms; i++)
    {
        __delay_cycles(1000);
    }
}

