adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
int putchar(int c)
{
    while (!(UCA1IFG & UCTXIFG))
        ;
    UCA1TXBUF = (unsigned char)c;
    return c;
}

void CopyArray(uint8_t *source, uint8_t *dest, uint8_t count)
{
    for (uint8_t i = 0; i < count; i++)
    {
        dest[i] = source[i];
    }
}

unsigned char Checksum(unsigned char *ptr, unsigned char len)
{
    unsigned char checksum = 0;

    for (unsigned char i = 0; i < len; i++)
    {
        checksum += ptr[i];
    }

    checksum = 0xff & ~checksum;
    return checksum;
}

//------------------------------------------------------------------------------
// I2C register access
//------------------------------------------------------------------------------

I2C_Mode I2C_ReadReg(uint8_t reg_addr, uint8_t *reg_data, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;
    RXByteCtr = count;
    TXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize device address and interrupts */
    UCB1I2CSA = DEV_ADDR;
    UCB1IFG &= ~(UCTXIFG + UCRXIFG);        // Clear any pending interrupts
    UCB1IE &= ~UCRXIE;                      // Disable RX interrupt
    UCB1IE |= UCTXIE;                       // Enable TX interrupt
    UCB1CTLW0 |= UCTR + UCTXSTT;            // I2C TX, start condition
    __bis_SR_register(LPM0_bits + GIE);     // Enter LPM0 w/ interrupts
    //For debugger
    __no_operation();

    /* Copy over received data */
    CopyArray(ReceiveBuffer, reg_data, count);

    return MasterMode;
}

I2C_Mode I2C_WriteReg(uint8_t reg_addr, uint8_t *reg_data, uint8_t count)
{
    /* Initialize state machine */
    MasterMode = TX_REG_ADDRESS_MODE;
    TransmitRegAddr = reg_addr;

    /* Copy register data to TransmitBuffer */
    CopyArray(reg_data, TransmitBuffer, count);

    TXByteCtr = count;
    RXByteCtr = 0;
    ReceiveIndex = 0;
    TransmitIndex = 0;

    /* Initialize device address and interrupts */
    UCB1I2CSA = DEV_ADDR;
    UCB1IFG &= ~(UCTXIFG + UCRXIFG);        // Clear any pending interrupts
    UCB1IE &= ~UCRXIE;                      // Disable RX interrupt
    UCB1IE |= UCTXIE;                       // Enable TX interrupt
    UCB1CTLW0 |= UCTR + UCTXSTT;            // I2C TX, start condition
    __bis_SR_register(LPM0_bits + GIE);     // Enter LPM0 w/ interrupts
    //For debugger
    __no_operation();

    return MasterMode;
}

//------------------------------------------------------------------------------
// Board support: GPIO, I2C, UART, port mapping
//------------------------------------------------------------------------------

void LED_On(int32_t ledPin)
{
    assert(ledPin >= 0 && ledPin <= 2);
    P8OUT &= ~(1 << ledPin);
}

void LED_Off(int32_t ledPin)
{
    assert(ledPin >= 0 && ledPin <= 2);
    P8OUT |= (1 << ledPin);
}

void GPIO_initPins(void)
{
    P1OUT = 0x00;
    P2OUT = 0x00;
    P3OUT = 0x00;
    P4OUT = 0x0F;
    P5OUT = 0x00;
    P6OUT = 0x00;
    P8OUT = 0x00;

    P1DIR = 0xFF;
    P2DIR = 0xFF;
    P3DIR = 0xFF;
    P4DIR = 0x00;
    P5DIR = 0xFF;
    P6DIR = 0xFF;
    P8DIR = 0xFF;

    GPIO_configPins();
}

void GPIO_configPins(void)
{
    // P8.0 (LED1)
    P8OUT &= ~BIT0;                 // Set P8.0 to low
    P8DIR |= BIT0;                  // Set P8.0 to output direction

    // P8.1 (LED2)
    P8OUT |= BIT1;                  // Set P8.1 to high
    P8DIR |= BIT1;                  // Set P8.1 to output direction

    // P8.2 (LED3)
    P8OUT |= BIT2;                  // Set P8.2 to high
    P8DIR |= BIT2;                  // Set P8.2 to output direction

    P3DIR &= ~(BIT3 | BIT4);        // Set P4.3 and P4.4 to input
    P3REN |= (BIT3 | BIT4);         // Enable pull up/down resistor
    P3OUT &= ~(BIT3 | BIT4);        // Output low (pull down)
}

void map_I2C_and_UART(void)
{
    PMAPKEYID = PMAPKEY; // Unlock port mapping 
    PMAPCTL |= PMAPRECFG;

    P4MAP4 = PM_UCB1SCL; // Set P4.4 as SCL
    P4MAP5 = PM_UCB1SDA; // Set P4.5 as SCL

    P4MAP2 = PM_UCA1RXD; // Set 4.2 as RXD
    P4MAP3 = PM_UCA1TXD; // Set 4.3 as TXD

    PMAPKEYID = 0;
}

void I2C_initModule(void)
{
    // --- Configure I2C pins for UCB1 on MSP430F5529 ---
    // P4.4 = UCB1SDA, P4.5 = UCB1SCL
    P4SEL |= BIT4 | BIT5;      // select peripheral function for P4.4/P4.5
    //P4SEL |= BIT6 | BIT7;      // select peripheral function for P4.6/P4.7

    // --- Configure USCI_B1 in I2C master mode ---
    UCB1CTL1 |= UCSWRST;       // hold USCI in reset

    // CTL0: sync, I2C, master
    UCB1CTL0 = UCMST       |   // master mode
               UCMODE_3    |   // I2C mode
               UCSYNC;         // synchronous mode

    // CTL1: SMCLK as source while still in reset
    UCB1CTL1 = UCSWRST | UCSSEL_2;   // UCSSEL_2 = SMCLK

    // Baud rate: BRCLK / (UCB1BR0+256*BR1)
    // For example: SMCLK = 16 MHz, BR=40 -> 400 kHz I2C
    // We are running now without FLL (1Mhz)
    UCB1BR0 = 10;
    UCB1BR1 = 0;

    // 7-bit slave address of BQ769x2 (0x08) – goes into UCB1I2CSA
    UCB1I2CSA = DEV_ADDR;

    // Release from reset and start operation
    UCB1CTL1 &= ~UCSWRST;

    // Enable NACK interrupt (optional – your ISR already handles NACK)
    UCB1IE |= UCNACKIE;
}

void UART_Init(void)
{
    P4SEL |= BIT2 | BIT3;
    P4DIR |= BIT3;
    P4DIR &= ~BIT2;

    UCA1CTL1 |= UCSWRST;
    UCA1CTL1 &= ~(UCSSEL_3);
    UCA1CTL0 = UCMODE_0;

    UCA1CTL1 |= UCSSEL_1; // ACLK
    UCA1BR0 = 0x03;
    UCA1BR1 = 0x00;
    UCA1MCTL = UCBRS_3 + UCBRF_0;

    UCA1CTL1 &= ~UCSWRST;
}

//------------------------------------------------------------------------------
// I2C ISR
//------------------------------------------------------------------------------
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B1_VECTOR
__interrupt void USCI_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__((interrupt(USCI_B1_VECTOR))) USCI_B1_ISR(void)
#else
#error Compiler not supported!
#endif
{
    uint8_t rx_val = 0;

    switch (UCB1IV)
    {
    case USCI_NONE:
        break;

    case USCI_I2C_UCALIFG:
        break;

