adom-inc/Modular_BMS/PlatformIO/MSP430_BQ76952/src/MSP430_I2C/main_MSP430FR2355_I2C.cpp
    case USCI_I2C_UCNACKIFG:
        break;

    case USCI_I2C_UCSTTIFG:
        break;

    case USCI_I2C_UCSTPIFG:
        break;

    case USCI_I2C_UCRXIFG3:
    case USCI_I2C_UCTXIFG3:
    case USCI_I2C_UCRXIFG2:
    case USCI_I2C_UCTXIFG2:
    case USCI_I2C_UCRXIFG1:
    case USCI_I2C_UCTXIFG1:
        break;

    case USCI_I2C_UCRXIFG0:
        rx_val = UCB1RXBUF;
        if (RXByteCtr)
        {
            ReceiveBuffer[ReceiveIndex++] = rx_val;
            RXByteCtr--;
        }

        if (RXByteCtr == 1)
        {
            UCB1CTLW0 |= UCTXSTP;
        }
        else if (RXByteCtr == 0)
        {
            UCB1IE &= ~UCRXIE;
            MasterMode = IDLE_MODE;
            __bic_SR_register_on_exit(CPUOFF);
        }
        break;

    case USCI_I2C_UCTXIFG0:
        switch (MasterMode)
        {
        case TX_REG_ADDRESS_MODE:
            UCB1TXBUF = TransmitRegAddr;
            if (RXByteCtr)
            {
                MasterMode = SWITCH_TO_RX_MODE;
            }
            else
            {
                MasterMode = TX_DATA_MODE;
            }
            break;

        case SWITCH_TO_RX_MODE:
            UCB1IE |= UCRXIE;
            UCB1IE &= ~UCTXIE;
            UCB1CTLW0 &= ~UCTR;
            MasterMode = RX_DATA_MODE;
            UCB1CTLW0 |= UCTXSTT;

            if (RXByteCtr == 1)
            {
                while (UCB1CTLW0 & UCTXSTT)
                    ;
                UCB1CTLW0 |= UCTXSTP;
            }
            break;

        case TX_DATA_MODE:
            if (TXByteCtr)
            {
                UCB1TXBUF = TransmitBuffer[TransmitIndex++];
                TXByteCtr--;
            }
            else
            {
                UCB1CTLW0 |= UCTXSTP;
                MasterMode = IDLE_MODE;
                UCB1IE &= ~UCTXIE;
                __bic_SR_register_on_exit(CPUOFF);
            }
            break;

        default:
            __no_operation();
            break;
        }
        break;

    default:
        break;
    }
}

#endif
